frontend/controllers/SiteController.php

SELECT * FROM `products` WHERE (`status`=1) AND (`hit`=1) LIMIT 10
SELECT * FROM `news` WHERE (`status`=1) AND (`hit`=1) ORDER BY `date` DESC LIMIT 9
SELECT * FROM `cars_slider` WHERE `status`=1
SELECT * FROM `regions` ORDER BY `name_ru`
---
    public function actionIndex()
    {
        // показать несколько товаров в галереи, у которых указано hit
        if(!$products = Products::find()->where(['status'=>1,'hit'=>1])->limit(10)->all()){
            $products= false;
        }

        if(!$news = News::find()->where(['status' => 1])->andwhere(['hit' => 1])->orderBy('date DESC')->limit(9)->all()){
            $news = false;
        }

        // слайдер разделов авто
        if(!$cars_slider = CarsSlider::find()->where(['status' => 1])->all()){
            $cars_slider = false;
        }

        if($_regions = Regions::find()->orderBy('name_ru ASC')->all()){

INSERT INTO `pickup_form` (`region`, `diller`, `last_name`, `first_name`, `phone`, `check`, `check1`, `middle_name`, `email`) VALUES ('Buxoro', 'behruz', 'dgjdfsbADS', 'behruz', '909515499', '1', '1', 'zokir ogli', 'behruztoxirov@gmail.com')
---
    public function actionPickupform()
        {
            $post = Yii::$app->request->post();


            $question = new PickupForm();

            if($question->load($post)) {

                if ($question->save()) {

SELECT * FROM `dillers` WHERE `region_id`='1'
---
public function actionDiller()
{
    $id = Yii::$app->request->get('id','');
        $dillers = ArrayHelper::map(Dillers::find()->where(['region_id'=>$id])->all(),'id','title_ru');