frontend/views/layouts/_header.php


$action = $action[0];

if($page = \common\models\Pages::find()->where(['page'=>'main'])->one()){
---
SELECT * FROM `pages` WHERE `page`='main'

    $page = false;

}
if($files = \common\models\Pages::find()->where(['page'=>'files'])->one()){
---
SELECT * FROM `pages` WHERE `page`='files'