frontend/views/layouts/main.php

SELECT * FROM `pages` WHERE `page`='files'
---
AppAsset::register($this);


if ($files = \common\models\Pages::find()->where(['page' => 'files'])->one()) {

SELECT * FROM `regions`
SELECT * FROM `dillers`
---
    $files = false;

}
$regions = Regions::find()->all();
$dillers = Dillers::find()->all();

SELECT * FROM `actions` WHERE (`status`=1) AND (`date_end` >= 1618943167)
---

if ($is_main && $show_action_popup) {

    if ($action = \common\models\Actions::find()->where(['status' => 1])->andWhere(['>=', 'date_end', time()])->one()) { ?>