frontend/views/site/index.php

$link = 'link_' . $lang;
$material = 'material_' . $lang;

if($page = \common\models\Pages::find()->where(['page'=>'main'])->one()){
---
SELECT * FROM `pages` WHERE `page`='main'

    $page = false;

}
if($contacts = \common\models\Pages::find()->where(['page'=>'contacts'])->one()){
---
SELECT * FROM `pages` WHERE `page`='contacts'

    $contacts = false;
}

if($files = \common\models\Pages::find()->where(['page'=>'files'])->one()){
---
SELECT * FROM `pages` WHERE `page`='files'